In [2]:
import pandas as pd

### Step 2. Read dataset, and assign it to a variable called users and use the
’user_id’ as index

In [3]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
users = pd.read_csv(url, sep='|', index_col='user_id')

### Step 3. See the frst 25 entries

In [4]:
users.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### Step 4. See the last 10 entries

In [5]:
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 5. What is the number of observations in the dataset?

In [6]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

### Step 6. What is the number of columns in the dataset?

In [10]:
users.shape[1]

4

### Step 7. Print the name of all the columns.

In [12]:
users.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 8. How is the dataset indexed?

In [13]:
users.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

### Step 9. What is the data type of each column?

In [28]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

### Step 10. Print only the occupation column

In [26]:
users['occupation'].info()

<class 'pandas.core.series.Series'>
Int64Index: 943 entries, 1 to 943
Series name: occupation
Non-Null Count  Dtype
--------------  -----
943 non-null    object
dtypes: object(1)
memory usage: 14.7+ KB

### Step 11. How many diﬀerent occupations are in this dataset?

In [39]:
occ_uniq = users['occupation'].value_counts()
occ_count = occ_uniq.count()
print(f'Number of diﬀerent occupations were {occ_count}.')

Number of diﬀerent occupations were 21.

### Step 12. What is the most frequent occupation?

In [114]:
gr = users.groupby('occupation').count()
grs = gr.sort_values(['age'], ascending= False)
grs.head(1)

            age  gender  zip_code
occupation
student     196     196       196

### Step 13. Summarize the DataFrame.

In [69]:
pd.DataFrame(users)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

### Step 14. Summarize all the columns

In [79]:
pd.DataFrame(users.columns)

            0
0         age
1      gender
2  occupation
3    zip_code

### Step 15. Summarize only the occupation column

In [77]:
pd.DataFrame(users['occupation'])

            occupation
user_id
1           technician
2                other
3               writer
4           technician
5                other
...                ...
939            student
940      administrator
941            student
942          librarian
943            student

[943 rows x 1 columns]

### Step 16. What is the mean age of users?

In [87]:
# users.head()
import numpy as np
age_gr = users.groupby('user_id').sum()
# age_gr
age_mean = age_gr.mean()['age']
np.round(age_mean, 2)

34.05

### Step 17. What is the age with least occurrence?

In [96]:
gr = users.groupby('age').count()
grits = gr.sort_values(['occupation'])
grits.head(10)

     gender  occupation  zip_code
age
7         1           1         1
66        1           1         1
73        1           1         1
10        1           1         1
11        1           1         1
62        2           2         2
69        2           2         2
68        2           2         2
64        2           2         2
58        3           3         3